org/high_performance_natural_language_processing.org
:PROPERTIES:
:ID:       9cbc8889-003e-4f27-98ea-10339215a896
:ROAM_REFS: https://slideslive.com/38940826
:END:
#+title: High Performance Natural Language Processing


We need high-performance [[id:4a817202-7d27-43c8-90a7-8417d38c731b][natural language processing]] to scale up NLP systems in
production.

There are several approaches to achieving speeding up NLP systems.

* [[id:c84ecd83-ef66-42e9-904a-adb17526e88a][Knowledge Distillation]]
** TODO DistillBert
** TODO MobileBert

* [[id:cb299df5-e052-4a8a-b885-9f749c7d6222][Making Transformer Models Efficient]]

* Pruning

Pruning removes "unimportant" weights from a network.
E.g. Prune based on second-order derivatives: "Optimal Brain Damage" and "Optimal Brain Surgeon"

** TODO [[id:f3a5b29f-6d27-48a5-bfca-ac7dd62a025d][Lottery Ticket Hypothesis]] in Transformer cite:brixSuccessfullyApplyingStabilized2020

bibliography:biblio.bib
